Repository: 03044117953/python-beginners
Catalog: source/locale/*/LC_MESSAGES/conditional_loops.po
Languages: de, es_cl

source: Conditional Loops
de: Bedingte Schleifen
es_cl: Loops Condicionales

source: Introduction
de: Einführung
es_cl: Introducción

source: Conditional loops are way to repeat something while a certain condition is satisfied, or **True**. If the condition is always satisfied (never becomes **False**), the loop can become infinite. If the condition starts off false, the code in the loop will never run! In Python conditional loops are defined with the ``while`` statement::
de: Bedingte Schleifen sind ein Weg etwas zu wiederholen solange eine bestimmte Bedingung erfüllt, oder **True**, ist. Falls die Bedingung immer erfüllt ist (also nie **False** wird) wird die Schleife endlos. Falls die Bedingung schon anfänglich falsch ist, wird der Code in der Schleife niemals ausgeführt! In Python werden bedingte Schleifen mit der ``while``\ -Anweisung definiert::
es_cl: Loops condicionales son la forma de repetir algo mientras se satisfaga cierta condición, o **True**. Si la condición se satisface siempre (nunca se vuelve **False**), el loop se vuelve infinito. Si la condición al inicio es falsa, el código del loop nunca se ejecutará! En Python los loops condicionales se definen con la sentencia ``while``::

source: We call this part of the code the 'conditional': ``'.' not in word``
de: Wir nennen diesen Teil des Quelltextes die 'Bedingung': ``'.' not in word``
es_cl: Esta parte del código la llamamos el 'condicional': ``'.' not in word``

source: Whether the conditional return True or not determines whether the code inside the ``while`` loop runs.
de: Ob die Bedingung wahr (True) zurückgibt oder nicht entscheidet, ob der Quelltext innerhalb der ``while``\ -Schleife ausgeführt wird.
es_cl: Si el condicional devuelve o no el valor True, determina si el código dentro del loop ``while`` se ejecuta.

source: Read the code above, and see if you can summarise in your head what it what it do (what its final output will be).
de: Lies den obigen Quelltext und schau, ob du in deinem Kopf zusammenfassen kannst was er tut (und was seine endgültige Ausgabe sein wird).
es_cl: Lea el código de arriba, y vea si puede resumir en su cabeza que es lo que hará (cual será la salida final).

source: Then copy it into a file, say :file:`sentence.py` and run it - see exactly what it does. Does that match up with what you thought?
de: Dann kopier ihn in eine Datei, sagen wir :file:`satz.py`, und führ ihn aus -- schau genau was er tut. Trifft das, was du dir gedacht hast?
es_cl: Luego cópielo a un archivo, digamos :file:`sentence.py` y ejecútelo - vea exactamente que hace. ¿Es el comportamiento tal como lo imaginó?

source: If you are using Python 2, you will need to replace ``input`` with ``raw_input`` to run the program correctly.
de: Falls du Python 2 benutzt wirst du ``input``mit ``raw_input`` ersetzen müssen um das Programm korrekt auszuführen.
es_cl: Si está usando Python 2, necesitará reemplazar ``input```con ``raw_input`` para ejecutar el programa correctamente.

source: Turtle prison
de: Schildkrötengefängnis
es_cl: Prisión Tortuga

source: Exercise
de: Übung
es_cl: Ejercicio

source: The turtle has been up to its usual tricks again, robbing liqour stores and building up huge gambling debts. It's time for turtle to be put into a cell that it can't get out of.
de: Die Schildkröte hat wieder ihre üblichen Spielchen abgezogen, Spirituosenläden ausrauben und riesige Spielschulden anhäufen. Es ist Zeit die Schildkröte in ein Gefängnis einzusperren aus dem sie nicht herauskommt.
es_cl: La tortuga ha estado haciendo de las suyas nuevamente, robando licorerías y adeudando mucho dinero al hacer apuestas. Es hora de poner a la tortuga en una celda de la cual no pueda salir.

source: Let's make a new version of ``forward()``. One that will turn the turtle around if it tries to go further than 100 from the origin. We'll need a ``while`` loop, and some new turtle functions:
de: Lass uns eine neue Version von ``forward()`` bauen. Eine die die Schildkröte herumdreht falls sie versucht sich weiter als 100 von ihrem Ursprung zu entfernen. Wir brauchen eine ``while``\ -Schleife und einige neue turtle-Funktionen:
es_cl: Hagamos una nueva versión de ``forward()``. Una que gire la tortuga a la dirección opuesta si trata de ir a más de 100 desde el origen. Necesitaremos un loop ``while``, y algunas funciones nuevas de turtle:

source: ``turtle.distance(0,0)`` - Distance of the turtle from the origin
de: ``turtle.distance(0, 0)``- Entfernung der Schildkröte vom Ursprung.
es_cl: ``turtle.distance(0,0)`` - Distancia de la tortuga al origen

source: ``turtle.towards(0,0)`` - The angle to get back to origin
de: ``turtle.towards(0, 0)`` - Der Winkel der zurück zum Ursprungspunkt führt.
es_cl: ``turtle.towards(0,0)`` - Ángulo para volver al origen

source: ``turtle.setheading(angle)`` - Directly sets the turtle direction
de: ``turtle.setheading(Winkel)`` - Setz direkt die Ausrichtung der Schildkröte
es_cl: ``turtle.setheading(angle)`` - Establecer dirección de la tortuga

source: You could try playing with a turtle in the interpreter and using these functions to check exactly what they do, if you like.
de: Du kannst versuchen mit der turtle in einem Interpreter herumzuspielen und die Funktionen zu benutzen um genau zu sehen was sie tun, wenn du magst.
es_cl: Si lo desea, puede intentar jugar con turtle en el intérprete y usar estas funciones para verificar que hacen ellas exactamente.

source: Now you will need to implement the prison logic using these turtle functions, perhaps a ``while`` loop and a bit of conditional logic. It's a bit of a stretch but keep at it! Don't be afraid to talk it out with a coach or another student.
de: Jetzt wirst du die Gefängnislogik implementieren müssen indem du die turtle-Funktionen verwendet, vielleicht eine ``while``\ -Schleife und ein bisschen bedingte Logik. Es ist ein bisschen haarig aber bleib dran! Scheu nicht zurück deine Idee mit einem Coach oder einem anderen Lernenden durchzusprechen.
es_cl: Ahora necesitará implementar la lógica de la prisión usando estas funciones, quizá con un loop ``while`` y un poco de lógica condicional. Es un poco complicado, pero ánimo! No tema consultar con algún profesor u otro estudiante.

source: Solution
de: Lösung
es_cl: Solución

source: Draw a spiral
de: Zeichne eine Spirale
es_cl: Dibuje una espiral

source: Loops can be interrupted with the ``break`` statement. This is especially useful if you write an *infinite loop*, which is a loop where the conditional is always **True**.
de: Schleifen können mit der ``break``\ -Anweisung unterbrochen werden. Das ist besonders nützlich wenn du eine *Endlosschleife* schreibst, was eine Schleife ist deren Bedingung immer wahr (**True**) ist.
es_cl: Loops pueden ser interrumpidos con una sentencia ``break``. Esto es especialmente útil si escribe un *loop infinito*, el cual es un loop donde su condicional es siempre **True**.

source: Write a ``while`` loop with a condition that is always **True** to draw a spiral. Interrupt the loop when the turtle reaches a certain distance from the center. Use the function ``turtle.distance(x, y)`` to get the turtle's distance to the point defined by the coordinates ``x`` and ``y``.
de: Schreib eine ``while``\ -Schleife mit einer Bedingung die immer wahr (**True**) ist um eine Spirale zu malen. Unterbrich die Schleife wenn die turtle eine gewissen Distanz zum Mittelpunkt erreicht hat. Benutz die Funktion ``turtle.distance(x, y)`` um die Entfernung der Schildkröte zu dem durch die ``x``\ - und ``y``\ -Koordinaten bestimmten Punkt zu errechnen.
es_cl: Escriba un loop ``while`` con una condición que sea siempre **verdadera** para dibujar un espiral. Interrumpa el loop cuando la tortuga alcance cierta distancia desde el centro. Use la función ``turtle.distance(x, y)`` para obtener la distancia al punto definido por las coordenadas ``x`` e ``y``.

source: To do this you will need the ``turtle.xcor()`` and ``turtle.ycor()`` functions, which return the position of the turtle in X and Y axes respectively.
de: Um das zu tun, brauchst Du die Funktionen ``turtle.xcor()`` und ``turtle.ycor()``, welche die Position der Schildkröte auf der X- und Y-Achse zurückgeben.
es_cl: Para hacer esto necesitará las funciones ``turtle.xcord()`` y ``turtle.ycord()``, las cuales retornan lka posición de la tortuga en los ejes X e Y respectivamente.

source: To draw a spiral, the turtle has to rotate by a constant value and move forward by an increasing value.
de: Um eine Spirale zu zeichnen, muss die Schildkröte um einen konstanten Winkel gedreht werden und dabei um eine anwachsende Strecke vorwärts bewegt werden.
es_cl: Para dibujar una espiral, la tortuga debe rotar con un valor constante y moverse adelante con un valor que se incremente.

source: Can you make a conditional for this loop, so you don't need the infinite loop ``while True`` or the ``break``? Which version do you find easier to understand?
de: Kannst du eine Bedingung für die Schleife formulieren so das du du keine Endlosschleife ``while True`` oder die ``break``\ -Anweisung benötigst. Welche Version findest du einfacher zu verstehen?
es_cl: Puede hacer un condicional para este loop, tal que no necesite un loop infinito ``while True```o la sentencia ``break``? que versión le parece más fácil de entender?
