Repository: 03044117953/python-beginners
Catalog: source/locale/*/LC_MESSAGES/simple_drawing.po
Languages: es_cl, ru

source: Simple drawing with turtle
es_cl: Dibujos simples con turtle (Tortuga)
ru: Простое рисование с помощью черепашки

source: Introduction
es_cl: Introducción
ru: Введение

source: Turtle is like a drawing board.
es_cl: Turtle es como una pizarra para dibujar.
ru: Черепашка похожа на доску для рисования.

source: It has functions like ``turtle.forward(...)`` and ``turtle.left(...)`` which can move the turtle around.
es_cl: Tiene funciones como ``turtle.forward(...)`` y ``turtle.left(...)`` que mueven la tortuga alrededor.
ru: У неё есть функции в стиле ``turtle.forward(...)`` и ``turtle.left(...)``, с помощью которых черепашка может двигаться.

source: Before you can use turtle, you have to import it (we'd recommend playing around with it in the interactive interpreter first, there is an extra bit of work required to make it work from files)::
es_cl: Antes de poder usar turtle, debe ser importado (recomendamos jugar un poco con el intérprete interactivo primero, se requiere un poco de trabajo extra primero para hacerlo funcionar desde archivos)::

source: Not seeing anything on Mac OS? Try looking if a new window opened behind your command line.
es_cl: No ve nada en Mac OS? Verifique si se abrió una ventana nueva detrás de la línea de comandos.

source: Do you work with Ubuntu and get the error message "No module named _tkinter"? Install the missing package with ``sudo apt-get install python-tk``
es_cl: Trabaja con Ubuntu y obtiene el mensaje de error "No existe el módulo llamado _tkinter"? Instale el paquete faltante con ``sudo apt-get install python-tk``

source: The ``turtle.forward(...)`` function tells the turtle to move forward by the given distance. ``turtle.left(...)`` takes a number of degrees which you want to rotate to the left. (There are ``turtle.backward(...)`` and ``turtle.right(...)``, too.)
es_cl: La función ``turtle.forward(...)`` le dice a la tortuga que se mueva adelante dada una distancia. ``turtle.left(...)`` toma un número de grados en que desee rotar a la izquierda. (Existen también las funciones ``turtle.backward(...) para ir atrás y ``turtle.right(...) para girar a la derecha).

source: The standard turtle is just a triangle. That's no fun! Let's make it a turtle instead with the ``turtle.shape()`` command::
es_cl: La tortuga estándar es sólo un triángulo. Eso no es divertido!. Transformemos el triángulo en tortuga con el comando ``turtle.shape()``::
ru: Стандартная "черепашка" -- всего лишь треугольник. Это не интересно! Придадим ей нормальный вид командой ``turtle.shape()``::

source: So much cuter!
es_cl: Mucho mejor!
ru: Так намного лучше!

source: If you put the commands into a file, you might have recognized that the turtle window vanishes after the turtle finished its movement. (That is because Python exits when your turtle has finished moving. Since the turtle window belongs to Python, it terminates as well.) To prevent that, just put ``turtle.exitonclick()`` at the bottom of your file. Now the window stays open until you click on it::
es_cl: Si pone los comandos en un archivo, verá que la ventana de la tortuga desaparece una vez que la tortuga finaliza sus movimientos (Esto sucede porque Python finaliza una vez que la tortuga termina de moverse. Dado que la ventana de turtle pertenece a Python, también termina). Para prevenir que esto suceda, sólo debe agregar el comando ``turtle.exitonclick()`` al final de su archivo. Ahora la ventana permanecerá abierta hasta que haga click en ella::

source: Python is a programming language where horizontal indenting of text is important. We'll learn all about this in the Functions chapter later on, but for now just keep in mind that stray spaces or tabs before any line of Python code will cause an unexpected error.
es_cl: Python es un lenguaje de programación donde la indentación horizontal del texto es importante. Aprenderemos todo acerca de esto luego en el capítulo sobre Funciones, pero por ahora tenga en mente que espacios o tabulaciones en cualquier línea del código Python pueden causar errores inesperados.

source: Drawing a square
es_cl: Dibujando un cuadrado
ru: Рисуем квадрат

source: You're not always expected to know the anwer immediately. Learn by trial and error! Experiment, see what python does when you tell it different things, what gives beautiful (although sometimes unexpected) results and what gives errors. If you want to keep playing with something you learned that creates interesting results, that's OK too. Don't hesitate to try and fail and learn from it!
es_cl: No se espera que conozca las respuestas de manera inmediata. Aprenda de intentos y errores! Experimente, vea lo que python hace cuando usted le dice diferentes cosas, que da hermosos (aunque a veces inesperados) resultados y que da errores. Si usted quiere seguir jugando con algo que haya aprendido que entrega resultados ineteresantes, está BIEN. No tema intentar y fallar y aprender de ello!

source: Exercise
es_cl: Ejercicio
ru: Упражнение

source: Draw a square as in the following picture:
es_cl: Dibuje un cuadrado como en la siguiente figura:
ru: Нарисуй квадрат, как на рисунке ниже:

source: For a square you will probably need a right angle, which is 90 degrees.
es_cl: Para dibujar un cuadrado probablemente necesite ángulos rectos, que son 90 grados.
ru: Для квадрата тебе понадобится прямоугольный, т.е. 90-градусный, угол.

source: Solution
es_cl: Solución
ru: Решение

source: Notice how the turtle starts and finishes in the same place and facing the same direction, before and after drawing the square. This is a useful convention to follow, it makes it easier to draw multiple shapes later on.
es_cl: Note como la tortuga parte y termina en el mismo lugar y mirando en la misma dirección, antes y después de dibujar el cuadrado. Esta es una convención muy útil a seguir, ya que es más fácil dibujar múltiples figuras después.

source: If you want to get creative, you can modify your shape with the ``turtle.width(...)`` and ``turtle.color(...)`` functions. How do you use these functions? Before you can use a function you need to know its *signature* (for example the number of parameters and what they mean.) To find this out you can type ``help(turtle.color)`` into the Python shell. If there is a lot of text, Python will put the help text into a *pager*, which lets you page up and down. Press the :kbd:`q` key to exit the pager.
es_cl: Si se quiere poner creativo, usted puede modificar la figura con las funciones ``turtle.width(...)`` y ``turtle.color(...)``. Cómo se usan estas funciones? Antes de usar una función debe conocer su *firma* (por ejemplo el número de parámetros y que significan). Para averiguar esto puede escribir ``help(turtle.color)`` en la consola de Python. Si hay mucho texto, Python pondrá el texto de ayuda en un *paginador*, el cual permitirá ir arriba y abajo en las páginas. Presione la tecla :kbd:`q` para salir del paginador.

source: Are you seeing an error like this::
es_cl: Está viendo un error como este::
ru: Видишь такую ошибку::

source: when trying to view help? In Python you have to import names before you can refer to them, so in a new Python interactive shell you'll need to ``import turtle`` before ``help(turtle.color)`` will work.
es_cl: cuando intenta ver la ayuda? En Python usted debe importar los nombres antes de poder referirse a ellos, por lo tanto en una nueva consola interactiva de Python debe ingresar ``import turtle`` antes que funcione ``help(turtle.color)``.
ru: когда пытаешься просмотреть справку? В Python необходимо импортировать имена, перед тем, как обращаться к ним, т.е. в нашем случае необходимо выполнить ``import turtle`` перед ``help(turtle.color)``.

source: Another way to find out about functions is to browse the `online documentation`_.
es_cl: Otra forma de saber sobre funciones en buscar en la `documentación en línea`.
ru: Также найти информацию о функциях можно в `онлайн-документации <http://docs.python.org/library/turtle>`_.

source: If you misdrew anything, you can tell turtle to erase its drawing board with the ``turtle.reset()`` directive or undo the most recent step with ``turtle.undo()``.
es_cl: Si usted se equivoca, puede decirle a la tortuga que borre la pizarra con la directiva ``turtle.reset()`` o deshacer el último paso con ``turtle.undo()``.

source: As you might have read in the help, you can modify the color with :samp:`turtle.color({colorstring})`. These include but are not limited to "red," "green," and "violet." See the `colours manual`_ for an extensive list.
es_cl: Como debe haber visto en la ayuda, puede modificar el color con :samp:`turtle.color({colorstring})`. Los colores pueden ser por ejemplo "red" (rojo), "green" (verde) y "violet" (violeta). Vea el `colours manual` (manual de colores) para una lista más extensiva.

source: Drawing a rectangle
es_cl: Dibujando un rectángulo
ru: Рисуем прямоугольник

source: Can you draw a rectangle too?
es_cl: Puede dibujar un rectángulo ahora?
ru: Ты тоже можешь нарисовать прямоугольник?

source: How about a triangle? In an equilateral triangle (a triangle with all sides of equal length) each corner has an angle of 60 degrees.
es_cl: Que tal un triángulo? En un triángulo equilátero (triángulo con todos sus lados del mismo largo) cada esquina tiene un ángulo de 60 grados.

source: More squares
es_cl: Más cuadrados
ru: Больше квадратов

source: Now, draw a tilted square. And another one, and another one. You can experiment with the angles between the individual squares.
es_cl: Ahora, dibuje un cuadrado inclinado. Y otro, y otro. Puede experimentar con los ángulos entre los diferentes cuadrados.

source: The picture shows three 20 degree turns. You could try 20, 30 and 40, for example.
es_cl: La figura muestra tres giros de 20 grados. Puede intentar con 20, 30 y 40, por ejemplo.
ru: На изображении показан поворот черепашки на 20 градусов. Ты же можешь попробовать, например, 30 или 40.

source: Before you can use turtle, you have to import it. We recommend playing around with it in the interactive interpreter first, as there is an extra bit of work required to make it work from files. Just go to your terminal and type::
ru: Перед тем как начать работу с черепашкой, необходимо импортировать соответствующий модуль. Мы рекомендуем экспериментировать с ней в интерактивной оболочке (для начала), т.к. при использовании файлов придётся заниматься дополнительной утомительной работой. Перейди в терминал и введи::

source: Do you work with Ubuntu and get the error message "No module named _tkinter"? Install the missing package with ``sudo apt-get install python3-tk``
ru: Используешь Ubuntu и получаешь сообщение об ошибке "No module named _tkinter"? Установи отсутствующий необходимый пакет: ``sudo apt-get install python3-tk``

source: The ``turtle.forward(...)`` function tells the turtle to move forward by the given distance. ``turtle.left(...)`` takes a number of degrees which you want to rotate to the left. There is also ``turtle.backward(...)`` and ``turtle.right(...)``, too.
ru: Функция ``turtle.forward(...)`` заставляет черепашку двигаться вперёд на указанное расстояние. ``turtle.left(...)`` приказывает черепашке повернуться влево на указанную градусную меру угла. А ``turtle.backward(...)`` и ``turtle.right(...)`` действуют анлогично — первая заставляет черепашку двигаться назад, а вторая — поворачиваться вправо.

source: Python is a programming language where horizontal indenting of text is important. We'll learn all about this in the Functions chapter later on, but for now just keep in mind that stray spaces or tabs before any line of Python code can cause an unexpected error.
ru: Python — язык программирования, в котором крайне важны отступы в коде. Подробности мы узнаем позже, в главах про функции, но сейчас тебе просто необходимо запомнить, что лишний пробел или символ табуляции перед строкой может вызвать ошибку.

source: Bonus
ru: Дополнительно
